       IDENTIFICATION DIVISION.
       PROGRAM-ID. Compiled.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 BFARRAY PIC 9(5) OCCURS 999999 TIMES.
       01 PTR PIC 9(6).
       01 INP PIC X.
       PROCEDURE DIVISION.
       MOVE 49999 TO PTR.
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       PERFORM UNTIL BFARRAY(PTR) EQUALS 0
       ADD 1 TO PTR
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO PTR
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO PTR
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO BFARRAY(PTR)
       ADD 1 TO PTR
       ADD 1 TO BFARRAY(PTR)
       SUBTRACT 1 FROM PTR
       SUBTRACT 1 FROM PTR
       SUBTRACT 1 FROM PTR
       SUBTRACT 1 FROM PTR
       SUBTRACT 1 FROM BFARRAY(PTR)
       END-PERFORM.
       ADD 1 TO PTR.
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       DISPLAY FUNCTION CHAR(BFARRAY(PTR)) WITH NO ADVANCING.
       SUBTRACT 1 FROM BFARRAY(PTR).
       ADD 1 TO PTR.
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       DISPLAY FUNCTION CHAR(BFARRAY(PTR)) WITH NO ADVANCING.
       SUBTRACT 1 FROM BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       DISPLAY FUNCTION CHAR(BFARRAY(PTR)) WITH NO ADVANCING.
       SUBTRACT 1 FROM BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       DISPLAY FUNCTION CHAR(BFARRAY(PTR)) WITH NO ADVANCING.
       SUBTRACT 1 FROM BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       DISPLAY FUNCTION CHAR(BFARRAY(PTR)) WITH NO ADVANCING.
       SUBTRACT 1 FROM BFARRAY(PTR).
       ADD 1 TO PTR.
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       DISPLAY FUNCTION CHAR(BFARRAY(PTR)) WITH NO ADVANCING.
       SUBTRACT 1 FROM BFARRAY(PTR).
       SUBTRACT 1 FROM PTR.
       SUBTRACT 1 FROM PTR.
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       DISPLAY FUNCTION CHAR(BFARRAY(PTR)) WITH NO ADVANCING.
       SUBTRACT 1 FROM BFARRAY(PTR).
       ADD 1 TO PTR.
       ADD 1 TO BFARRAY(PTR).
       DISPLAY FUNCTION CHAR(BFARRAY(PTR)) WITH NO ADVANCING.
       SUBTRACT 1 FROM BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       DISPLAY FUNCTION CHAR(BFARRAY(PTR)) WITH NO ADVANCING.
       SUBTRACT 1 FROM BFARRAY(PTR).
       SUBTRACT 1 FROM BFARRAY(PTR).
       SUBTRACT 1 FROM BFARRAY(PTR).
       SUBTRACT 1 FROM BFARRAY(PTR).
       SUBTRACT 1 FROM BFARRAY(PTR).
       SUBTRACT 1 FROM BFARRAY(PTR).
       SUBTRACT 1 FROM BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       DISPLAY FUNCTION CHAR(BFARRAY(PTR)) WITH NO ADVANCING.
       SUBTRACT 1 FROM BFARRAY(PTR).
       SUBTRACT 1 FROM BFARRAY(PTR).
       SUBTRACT 1 FROM BFARRAY(PTR).
       SUBTRACT 1 FROM BFARRAY(PTR).
       SUBTRACT 1 FROM BFARRAY(PTR).
       SUBTRACT 1 FROM BFARRAY(PTR).
       SUBTRACT 1 FROM BFARRAY(PTR).
       SUBTRACT 1 FROM BFARRAY(PTR).
       SUBTRACT 1 FROM BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       DISPLAY FUNCTION CHAR(BFARRAY(PTR)) WITH NO ADVANCING.
       SUBTRACT 1 FROM BFARRAY(PTR).
       ADD 1 TO PTR.
       ADD 1 TO BFARRAY(PTR).
       ADD 1 TO BFARRAY(PTR).
       DISPLAY FUNCTION CHAR(BFARRAY(PTR)) WITH NO ADVANCING.
       SUBTRACT 1 FROM BFARRAY(PTR).
       ADD 1 TO PTR.
       ADD 1 TO BFARRAY(PTR).
       DISPLAY FUNCTION CHAR(BFARRAY(PTR)) WITH NO ADVANCING.
       SUBTRACT 1 FROM BFARRAY(PTR).
       STOP RUN.